# LV4 : json / JSON 파일을 불러와주세요.
# step4.json

# 결과
# {'@': {'\n': {'역사': 1}}, '\n': {'역사': {'\n': 1}, '왕숙천': {'\n': 1}, '청년': {'\n': 1}, '문화': {'예술': 1}, '함흥차사': {'\n': 1}, '이성계': {'\n': 1}, '한양': {'\n': 1}, '남양주': {'\n': 1}, '마을': {'\n': 1}, '여덟': {'\n': 1}, '팔': {'야': 1}, '진접읍': {'\n': 1}, '팔야리': {'\n': 1}, '하천': {'\n': 1}, '왕': {'\n': 1}}, '역사': {'\n': {'왕숙천': 1}}, '왕숙천': {'\n': {'청년': 1}}, '청년': {'\n': {'문화': 1}}, '문화': {'예술': {'도시': 1}}, '예술': {'도시': {'\n': 1}}, '도시': {'\n': {'함흥차사': 1}}, '함흥차사': {'\n': {'이성계': 1}}, '이성계': {'\n': {'한양': 1}}, '한양': {'\n': {'남양주': 1}}, '남양주': {'\n': {'마을': 1}}, '마을': {'\n': {'여덟': 1}}, '여덟': {'\n': {'팔': 1}}, '팔': {'야': {'\n': 1}}, '야': {'\n': {'진접읍': 1}}, '진접읍': {'\n': {'팔야리': 1}}, '팔야리': {'\n': {'하천': 1}}, '하천': {'\n': {'왕': 1}}}
# {'\n': {'마을': 1}}
# {'\n': {'이성계': 1}}
import json

with open('C://Users\mingzzang\Desktop\step4.json', 'r', encoding='euc-kr') as json_file:
    json_object = json.load(json_file)

    print(json_object)
    print(json_object["남양주"])
    print(json_object["함흥차사"])

